Revit 2027 API
ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtEnd Property
 "Parallel Treads at End": Number of straight steps at the begin of winder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtEnd { get; }
Public Shared ReadOnly Property StairsWinderpatternNumberOfStraightStepsAtEnd As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsWinderpatternNumberOfStraightStepsAtEnd {
	ForgeTypeId^ get ();
}
static member StairsWinderpatternNumberOfStraightStepsAtEnd : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace